jmeter_test_plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
<hashTree>

<TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="AI Chat API Load Test" enabled="true">
<stringProp name="TestPlan.comments">
Performance test simulating concurrent AI chatbot users
</stringProp>
</TestPlan>

<hashTree>

<ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Concurrent AI Users" enabled="true">
<intProp name="ThreadGroup.num_threads">5</intProp>
<intProp name="ThreadGroup.ramp_time">5</intProp>
<longProp name="ThreadGroup.duration">60</longProp>
<boolProp name="ThreadGroup.scheduler">true</boolProp>
<stringProp name="ThreadGroup.on_sample_error">continue</stringProp>

<elementProp name="ThreadGroup.main_controller" elementType="LoopController">
<stringProp name="LoopController.loops">-1</stringProp>
<boolProp name="LoopController.continue_forever">true</boolProp>
</elementProp>

</ThreadGroup>

<hashTree>

<!-- CSV DATA SOURCE -->

<CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Prompt Dataset" enabled="true">
<stringProp name="filename">test_data/prompts.csv</stringProp>
<stringProp name="variableNames">prompt</stringProp>
<stringProp name="delimiter">,</stringProp>
<boolProp name="recycle">true</boolProp>
<boolProp name="stopThread">false</boolProp>
<stringProp name="shareMode">shareMode.all</stringProp>
</CSVDataSet>

<hashTree/>

<!-- HTTP HEADERS -->

<HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
<collectionProp name="HeaderManager.headers">

<elementProp name="" elementType="Header">
<stringProp name="Header.name">Content-Type</stringProp>
<stringProp name="Header.value">application/json</stringProp>
</elementProp>

</collectionProp>
</HeaderManager>

<hashTree/>

<!-- USER THINK TIME -->

<ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="User Think Time" enabled="true">
<stringProp name="ConstantTimer.delay">300</stringProp>
</ConstantTimer>

<hashTree/>

<!-- API REQUEST -->

#<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chat Prompt - ${prompt}" enabled="true">
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST Chat Prompt" enabled="true">
<stringProp name="HTTPSampler.domain">localhost</stringProp>
<stringProp name="HTTPSampler.port">5000</stringProp>
<stringProp name="HTTPSampler.protocol">https</stringProp>

<stringProp name="HTTPSampler.path">/chat</stringProp>
<stringProp name="HTTPSampler.method">POST</stringProp>

<boolProp name="HTTPSampler.postBodyRaw">true</boolProp>

<elementProp name="HTTParguments" elementType="Arguments">
<collectionProp name="Arguments.arguments">

<elementProp name="" elementType="HTTPArgument">
<stringProp name="Argument.value">
{"prompt":"${prompt}"}
</stringProp>
<stringProp name="Argument.metadata">=</stringProp>
</elementProp>

</collectionProp>
</elementProp>

</HTTPSamplerProxy>

<hashTree>

<!-- RESPONSE ASSERTION -->

<ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Validate JSON Response" enabled="true">
<collectionProp name="Asserion.test_strings">
<stringProp name="response_check">response</stringProp>
</collectionProp>
<stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
<intProp name="Assertion.test_type">2</intProp>
</ResponseAssertion>

<hashTree/>

</hashTree>

<!-- RESULTS -->
<ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Request Response Trace" enabled="true">
<stringProp name="filename">request_response_trace.jtl</stringProp>
</ResultCollector>
<hashTree/>
<ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true"/>
<hashTree/>

<ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true"/>
<hashTree/>

</hashTree>

</hashTree>

</hashTree>
</jmeterTestPlan>